agenticaiuw/hivemind/firmware/nrf9160/src/main.c
			int32_t sample = ((first + second) / 2) >> 8;

			/* DC blocker: the SPH0645 sits about 5% off center.
			 * Warm-start on the first frame so the standing
			 * offset does not enter as an audible step.
			 */
			if (!hpf_primed) {
				hpf_prev_in = sample;
				hpf_primed = true;
			}
			int32_t filtered = sample - hpf_prev_in +
				(int32_t)(((int64_t)MIC_HPF_COEFF_Q15 *
					   hpf_prev_out) >> 15);
			hpf_prev_in = sample;
			hpf_prev_out = filtered;

			int32_t amplified = filtered * MIC_GAIN;

			amplified = CLAMP(amplified, INT16_MIN, INT16_MAX);

			int32_t absolute =
				amplified < 0 ? -amplified : amplified;

			mic_stage_samples[stage_frames] = (int16_t)amplified;
			if (++stage_frames == MIC_STAGE_FRAMES) {
				live_write_error = write_pcm_frames(
					&file, mic_stage_samples,
					MIC_STAGE_FRAMES);
				if (live_write_error == 0 &&
				    pendant_opus_stream_active()) {
					live_write_error =
						pendant_opus_stream_feed(
							mic_stage_samples,
							MIC_STAGE_FRAMES);
					if (live_write_error != 0) {
						printk("Opus live feed failed: %d\n",
						       live_write_error);
						pendant_opus_stream_abort();
						live_write_error = 0; /* PCM still OK */
					}
				}
				stage_frames = 0U;
				++sd_flush_count;
				if (live_write_error != 0) {
					break;
				}
			}
			minimum_sample = MIN(minimum_sample,
					     (int16_t)amplified);
			maximum_sample = MAX(maximum_sample,
					     (int16_t)amplified);
			square_sum += (uint64_t)((int64_t)amplified *
						 amplified);
			if (have_previous_sample &&
			    ((previous_sample < 0 && amplified >= 0) ||
			     (previous_sample >= 0 && amplified < 0))) {
				++zero_crossings;
			}
			previous_sample = (int16_t)amplified;
			have_previous_sample = true;
			recorded_peak = MAX(recorded_peak,
					    (uint16_t)MIN(absolute,
							  UINT16_MAX));
			recording_absolute_sum += (uint32_t)absolute;

			++sample_index;
		}

		recorded_samples = sample_index;
		k_mem_slab_free(&mic_rx_slab, block);
		if (live_write_error != 0) {
			printk("I2S mic live SD write failed: %d\n",
			       live_write_error);
			(void)i2s_trigger(i2s, I2S_DIR_RX, I2S_TRIGGER_DROP);
			k_msleep(MIC_STOP_SETTLE_MS);
			mic_clocks_stop();
			(void)fs_close(&file);
			sd_ready = false;
			sd_mount_result = live_write_error;
			return live_write_error;
		}
		if (sample_index >= next_trace_sample) {
			uint32_t rms = integer_square_root(
				square_sum / sample_index);

			printk("I2S mic live: samples=%u mean=%u peak=%u "
			       "rms=%u min=%d max=%d zero_crossings=%u\n",
			       recorded_samples,
			       (uint32_t)(recording_absolute_sum /
					  recorded_samples),
			       recorded_peak, rms, minimum_sample,
			       maximum_sample, zero_crossings);
			next_trace_sample += SAMPLE_RATE;
		}

		if (k_uptime_get() >= next_led_toggle) {
			gpio_pin_toggle_dt(&led);
			next_led_toggle = k_uptime_get() + 250;
		}

		/*
		 * Ignore switch bounce or a second edge left over from the start
		 * press. A valid voice sample needs at least one second anyway.
		 * The check must not block: waiting for the physical release
		 * here would starve the RX slab and overrun the driver.
		 */
		if (sample_index < MIC_MIN_RECORD_FRAMES) {
			clear_button_events();
		} else if (k_sem_take(&button_press_sem, K_NO_WAIT) == 0) {
			recording_stopped_by_button = true;
			break;
		}
	}

	/*
	 * DROP stops reception at once and frees the driver-held RX
	 * blocks internally, so no drain loop is needed and nothing can
	 * pend on the 1500 ms read timeout.
	 */
	error = i2s_trigger(i2s, I2S_DIR_RX, I2S_TRIGGER_DROP);
	k_msleep(MIC_STOP_SETTLE_MS);
	mic_clocks_stop();
	if (recording_stopped_by_button) {
		/* Debounce now that the stream no longer depends on it. */
		finish_button_press();
	}

	int write_error = stage_frames > 0U
		? write_pcm_frames(&file, mic_stage_samples, stage_frames)
		: 0;
	if (write_error == 0 && stage_frames > 0U &&
	    pendant_opus_stream_active()) {
		int feed_error =
			pendant_opus_stream_feed(mic_stage_samples, stage_frames);
		if (feed_error != 0) {
			printk("Opus live final feed failed: %d\n", feed_error);
			pendant_opus_stream_abort();
		}
	}
	int sync_error = write_error == 0 ? fs_sync(&file) : write_error;
	int close_error = fs_close(&file);

	if (error == 0) {
		error = sync_error != 0 ? sync_error : close_error;
	}
	if (write_error != 0 || sync_error != 0 || close_error != 0) {
		printk("I2S mic save failed: write=%d sync=%d close=%d\n",
		       write_error, sync_error, close_error);
	}

	uint32_t rms = recorded_samples == 0U
		? 0U
		: integer_square_root(square_sum / recorded_samples);
	printk("I2S mic capture totals: samples=%u mean=%u peak=%u rms=%u "
	       "min=%d max=%d zero_crossings=%u sd_flushes_live=%u "
	       "opus_live=%d\n",
	       recorded_samples,
	       recorded_samples == 0U
		       ? 0U
		       : (uint32_t)(recording_absolute_sum /
				    recorded_samples),
	       recorded_peak, rms, minimum_sample, maximum_sample,
	       zero_crossings, sd_flush_count,
	       pendant_opus_stream_active() ? 1 : 0);
	return error;
}

static int queue_i2s_stream_preamble(const struct device *i2s)
{
	for (uint32_t block_index = 0U;
	     block_index < I2S_SYNC_PATTERN_BLOCKS + 1U; ++block_index) {
		void *block;
		int16_t *output;
		int error = k_mem_slab_alloc(&i2s_slab, &block, K_FOREVER);

		if (error != 0) {
			return error;
		}
		output = block;

		for (uint32_t frame = 0U; frame < I2S_BLOCK_FRAMES; ++frame) {
			int16_t sample = 0;

			if (block_index < I2S_SYNC_PATTERN_BLOCKS) {
				uint32_t absolute_frame =
					block_index * I2S_BLOCK_FRAMES + frame;

				sample = (absolute_frame & 1U) != 0U
					 ? I2S_STREAM_SYNC_B
					 : I2S_STREAM_SYNC_A;
			} else if (frame < I2S_SYNC_END_FRAMES) {
				sample = I2S_STREAM_SYNC_END;
			}

			output[2U * frame] = sample;
			output[2U * frame + 1U] = sample;
		}

		error = i2s_write(i2s, block, I2S_BLOCK_SIZE);
		if (error != 0) {
			k_mem_slab_free(&i2s_slab, block);
			return error;
		}
	}

