agenticaiuw/hivemind/firmware/nrf9160/src/main.c
	return 0;
}

static int play_agent_reply(const struct device *i2s,
			    const char *pcm_path)
{
	struct i2s_config config = {
		.word_size = 16U,
		.channels = I2S_CHANNEL_COUNT,
		.format = I2S_FMT_DATA_FORMAT_I2S,
		.options = I2S_OPT_FRAME_CLK_CONTROLLER |
			   I2S_OPT_BIT_CLK_CONTROLLER,
		.frame_clk_freq = PENDANT_CLOUD_REPLY_SAMPLE_RATE,
		.mem_slab = &i2s_slab,
		.block_size = I2S_BLOCK_SIZE,
		.timeout = 3000,
	};
	struct fs_file_t file;
	struct fs_dirent entry;
	int16_t mono[I2S_BLOCK_FRAMES];
	uint32_t queued_blocks = I2S_SYNC_PATTERN_BLOCKS + 1U;
	uint32_t played_samples = 0U;
	bool started = false;
	bool file_open = false;
	int error;

	error = fs_stat(pcm_path, &entry);
	if (error != 0 || entry.type != FS_DIR_ENTRY_FILE ||
	    entry.size == 0U || (entry.size & 1U) != 0U) {
		return error != 0 ? error : -EBADMSG;
	}

	fs_file_t_init(&file);
	error = fs_open(&file, pcm_path, FS_O_READ);
	if (error != 0) {
		return error;
	}
	file_open = true;

	error = i2s_configure(i2s, I2S_DIR_TX, &config);
	if (error != 0) {
		goto out;
	}
	error = queue_i2s_stream_preamble(i2s);
	if (error != 0) {
		goto out;
	}

	while (true) {
		ssize_t bytes_read = fs_read(&file, mono, sizeof(mono));
		void *block;
		int16_t *output;

		if (bytes_read < 0) {
			error = (int)bytes_read;
			goto out;
		}
		if (bytes_read == 0) {
			break;
		}
		if ((bytes_read & 1) != 0) {
			error = -EBADMSG;
			goto out;
		}

		size_t frames = (size_t)bytes_read / sizeof(int16_t);

		error = k_mem_slab_alloc(&i2s_slab, &block, K_FOREVER);
		if (error != 0) {
			goto out;
		}
		output = block;
		for (size_t frame = 0U; frame < frames; ++frame) {
			output[2U * frame] = mono[frame];
			output[2U * frame + 1U] = mono[frame];
		}
		for (size_t frame = frames;
		     frame < I2S_BLOCK_FRAMES; ++frame) {
			output[2U * frame] = 0;
			output[2U * frame + 1U] = 0;
		}

		error = i2s_write(i2s, block, I2S_BLOCK_SIZE);
		if (error != 0) {
			k_mem_slab_free(&i2s_slab, block);
			goto out;
		}
		played_samples += (uint32_t)frames;
		++queued_blocks;

		if (!started && queued_blocks >= I2S_PREFILL_BLOCKS) {
			error = i2s_trigger(i2s, I2S_DIR_TX,
					    I2S_TRIGGER_START);
			if (error != 0) {
				goto out;
			}
			started = true;
		}
	}

	if (!started) {
		error = i2s_trigger(i2s, I2S_DIR_TX, I2S_TRIGGER_START);
		if (error != 0) {
			goto out;
		}
		started = true;
	}

	error = i2s_trigger(i2s, I2S_DIR_TX, I2S_TRIGGER_DRAIN);
	if (error == 0) {
		printk("Played %u samples of agent speech at %u Hz\n",
		       played_samples, PENDANT_CLOUD_REPLY_SAMPLE_RATE);
	}

out:
	if (file_open) {
		int close_error = fs_close(&file);

		if (error == 0) {
			error = close_error;
		}
	}
	if (error != 0 && started) {
		(void)i2s_trigger(i2s, I2S_DIR_TX, I2S_TRIGGER_DROP);
	}
	return error;
}

static void show_error(void)
{
	while (true) {
		gpio_pin_toggle_dt(&led);
		k_msleep(100);
	}
}

int main(void)
{
	const struct device *const i2s = DEVICE_DT_GET(I2S_NODE);
	int error;

	if (!gpio_is_ready_dt(&led)) {
		audio_cycle_result = -ENODEV;
		return 0;
	}
	error = gpio_pin_configure_dt(&led, GPIO_OUTPUT_INACTIVE);
	if (error != 0) {
		audio_cycle_result = error;
		return 0;
	}
	if (!gpio_is_ready_dt(&button)) {
		audio_cycle_result = -ENODEV;
		show_error();
	}
	error = gpio_pin_configure_dt(&button, GPIO_INPUT);
	if (error != 0) {
		audio_cycle_result = error;
		show_error();
	}
	gpio_init_callback(&button_callback, button_pressed, BIT(button.pin));
	error = gpio_add_callback(button.port, &button_callback);
	if (error != 0) {
		audio_cycle_result = error;
		show_error();
	}
	error = gpio_pin_interrupt_configure_dt(&button, GPIO_INT_EDGE_TO_ACTIVE);
	if (error != 0) {
		audio_cycle_result = error;
		show_error();
	}
	if (!device_is_ready(i2s)) {
		audio_cycle_result = -ENODEV;
		show_error();
	}

	if (mount_sd_card() == 0 && test_sd_persistence() != 0) {
		sd_ready = false;
	}
	if (!sd_ready) {
		printk("microSD is required for Internet voice upload\n");
		audio_cycle_result = sd_mount_result;
		show_error();
	}

#if PENDANT_BOOT_DUMP_PCM_HEX
	if (sd_ready) {
		(void)dump_sd_recording_hex();
	}
#endif

	/* Boot card check: two slow flashes means the required SD card mounted. */
	for (unsigned int flash = 0U; flash < 2U; ++flash) {
		gpio_pin_set_dt(&led, 1);
		k_msleep(160);
		gpio_pin_set_dt(&led, 0);
		k_msleep(160);
	}

#if PENDANT_BOOT_AUTORECORD_TEST
	clear_button_events();
	printk("BOOT_MIC_AUTOTEST_BEGIN\n");
	error = record_microphone(i2s, AUTORECORD_TEST_SAMPLE_COUNT);
	gpio_pin_set_dt(&led, 0);
	printk("BOOT_MIC_AUTOTEST_END result=%d samples=%u\n",
	       error, recorded_samples);
	report_main_stack_headroom("capture");
	if (error != 0) {
		audio_cycle_result = error;
		show_error();
	}
#endif

#if PENDANT_BOOT_ENCODE_SELFTEST
	/* Runs before LTE so a network problem cannot mask a codec fault. */
	if (encode_stack_selftest() != 0) {
		printk("Encode stack selftest failed\n");
	}
#endif

	/* Solid LED while the modem registers and establishes the LTE session. */
	gpio_pin_set_dt(&led, 1);
	error = pendant_cloud_init();
	gpio_pin_set_dt(&led, 0);
	if (error != 0) {
		printk("LTE initialization failed: %d\n", error);
		audio_cycle_result = error;
		show_error();
	}

	if (CONFIG_PENDANT_BOOT_AGENT_JOB_ID[0] != '\0') {
		printk("BOOT_AGENT_REPLY_TEST_BEGIN job=%s\n",
		       CONFIG_PENDANT_BOOT_AGENT_JOB_ID);
		error = pendant_cloud_set_job_id_for_diagnostic(
			CONFIG_PENDANT_BOOT_AGENT_JOB_ID);
		if (error == 0) {
			error = pendant_cloud_wait_for_agent_reply(
				PENDANT_CLOUD_REPLY_AUDIO_PATH);
		}
		if (error == 0 &&
		    pendant_cloud_reply_format ==
			    PENDANT_CLOUD_AUDIO_OGG_OPUS) {
			struct pendant_opus_stats decode_stats;

			error = pendant_opus_decode_file(
				PENDANT_CLOUD_REPLY_AUDIO_PATH,
				PENDANT_CLOUD_REPLY_PCM_PATH,
				audio_workspace, sizeof(audio_workspace),
				&decode_stats);
		}
		printk("BOOT_AGENT_REPLY_TEST_END result=%d HTTP=%d "
		       "PCM bytes=%u\n",
		       error, pendant_cloud_last_http_status,
		       pendant_cloud_reply_pcm_bytes);
	}

#if PENDANT_BOOT_UPLOAD_EXISTING
	printk("Boot diagnostic: uploading existing SD recording\n");
	gpio_pin_set_dt(&led, 1);
	struct pendant_opus_stats boot_encode_stats = { 0 };
	int64_t lat_cycle_started = k_uptime_get();

