agenticaiuw/hivemind/firmware/nrf9160/src/main.c
	error = pendant_opus_encode_file(
		SD_RECORDING_PATH, SD_OPUS_PATH, SAMPLE_RATE,
		audio_workspace, sizeof(audio_workspace), &boot_encode_stats);
	int64_t lat_encode_done = k_uptime_get();

	printk("Boot encode result: %d (packets=%u in=%u out=%u)\n", error,
	       boot_encode_stats.packets, boot_encode_stats.input_bytes,
	       boot_encode_stats.output_bytes);
	printk("LAT encode_ms=%lld pcm_in=%u ogg_out=%u packets=%u "
	       "audio_ms=%u\n",
	       lat_encode_done - lat_cycle_started,
	       boot_encode_stats.input_bytes, boot_encode_stats.output_bytes,
	       boot_encode_stats.packets,
	       (uint32_t)(boot_encode_stats.input_bytes /
			  (SAMPLE_RATE * sizeof(int16_t) / 1000U)));
	report_main_stack_headroom("boot encode");
	if (error == 0) {
		/* Single-shot /v1/pendant/command — no separate announce TLS. */
		error = pendant_cloud_upload_recording(
			SD_OPUS_PATH, boot_encode_stats.input_bytes, SAMPLE_RATE);
	}
	printk("LAT cycle_to_dispatch_ms=%lld\n",
	       k_uptime_get() - lat_cycle_started);
	gpio_pin_set_dt(&led, 0);
	printk("Boot upload result: %d (transcribe=%d dispatch=%d HTTP=%d "
	       "PCM bytes=%u)\n",
	       error, pendant_cloud_transcribe_result,
	       pendant_cloud_dispatch_result,
	       pendant_cloud_last_http_status,
	       pendant_cloud_uploaded_pcm_bytes);
	report_main_stack_headroom("boot upload");
	audio_cycle_result = error;
#endif

	clear_button_events();

	while (true) {
		/* Ready: button 1 starts a new recording. */
		audio_cycle_phase = 0U;
		gpio_pin_set_dt(&led, 0);
		/* Keep a TLS session warm between presses so the next cycle
		 * does not pay a full LTE handshake if the idle window is short.
		 */
		pendant_cloud_prewarm_start();
		wait_for_button_press();

		/* Recording: blinking LED; button 1 stops recording. */
		/*
		 * LTE stays attached during recording.  The RF-off isolation
		 * was a PDM-era noise workaround; it made every cycle pay a
		 * network reattach (which could hang for minutes) before the
		 * upload could start.  The I2S capture path buffers deeply
		 * and the slew limiter absorbs coupled impulses.
		 */
		audio_cycle_phase = 1U;
		error = record_microphone(i2s, MAX_RECORD_SAMPLE_COUNT);
		gpio_pin_set_dt(&led, 0);
		audio_cycle_phase = 2U;
		if (error != 0) {
			printk("Microphone recording failed: %d\n", error);
			audio_cycle_result = error;
			flash_led(3U, 120, 120);
			clear_button_events();
			continue;
		}

		/*
		 * Stopped/processing: LED stays off while the captured voice goes
		 * to the relay and the Mac prepares its spoken response.
		 */
		audio_cycle_phase = 3U;
		struct pendant_opus_stats encode_stats = { 0 };
		int64_t lat_press_started = k_uptime_get();

		/*
		 * Overlap final Ogg close with TLS readiness: if the during-
		 * record prewarm finished, upload uses it; if not, kick one
		 * more attempt while stream_end flushes the last page.
		 */
		pendant_cloud_prewarm_start();
		if (pendant_opus_stream_active()) {
			error = pendant_opus_stream_end(&encode_stats);
			printk("LAT encode_ms=%lld (live) pcm_in=%u ogg_out=%u "
			       "packets=%u\n",
			       k_uptime_get() - lat_press_started,
			       encode_stats.input_bytes,
			       encode_stats.output_bytes, encode_stats.packets);
		} else {
			error = pendant_opus_encode_file(
				SD_RECORDING_PATH, SD_OPUS_PATH, SAMPLE_RATE,
				audio_workspace, sizeof(audio_workspace),
				&encode_stats);
			printk("LAT encode_ms=%lld (fallback file) pcm_in=%u "
			       "ogg_out=%u packets=%u\n",
			       k_uptime_get() - lat_press_started,
			       encode_stats.input_bytes,
			       encode_stats.output_bytes, encode_stats.packets);
		}
		report_main_stack_headroom("encode");
		if (error != 0) {
			printk("Opus recording compression failed: %d\n", error);
			pendant_cloud_prewarm_cancel();
			audio_cycle_result = error;
			flash_led(4U, 100, 100);
			continue;
		}
		/*
		 * One TLS + raw Ogg to /v1/pendant/command (STT + Mac queue).
		 * Skipping the separate announce/dispatch handshakes saves
		 * ~10–20 s of pure radio time on a typical cycle.
		 */
		error = pendant_cloud_upload_recording(
			SD_OPUS_PATH, encode_stats.input_bytes, SAMPLE_RATE);
		printk("LAT press_to_upload_done_ms=%lld\n",
		       k_uptime_get() - lat_press_started);
		if (error != 0) {
			printk("Internet voice cycle failed: %d "
			       "(transcribe=%d dispatch=%d HTTP=%d)\n",
			       error, pendant_cloud_transcribe_result,
			       pendant_cloud_dispatch_result,
			       pendant_cloud_last_http_status);
			audio_cycle_result = error;
			flash_led(5U, 100, 100);
			/* Still try to warm a socket for the next attempt. */
			pendant_cloud_prewarm_start();
			continue;
		}
		/* Next press can reuse a warm TLS session while we wait/play. */
		pendant_cloud_prewarm_start();

		audio_cycle_phase = 4U;
		gpio_pin_set_dt(&led, 0);
		error = pendant_cloud_wait_for_agent_reply(
			PENDANT_CLOUD_REPLY_AUDIO_PATH);
		if (error == -ECANCELED) {
			/* Button pressed while polling: skip this reply and
			 * go straight back to Ready for a new recording.
			 */
			printk("Reply wait canceled by button press\n");
			finish_button_press();
			continue;
		}
		const char *reply_pcm_path = PENDANT_CLOUD_REPLY_AUDIO_PATH;
		if (pendant_cloud_reply_format ==
		    PENDANT_CLOUD_AUDIO_OGG_OPUS) {
			struct pendant_opus_stats decode_stats;

			error = pendant_opus_decode_file(
				PENDANT_CLOUD_REPLY_AUDIO_PATH,
				PENDANT_CLOUD_REPLY_PCM_PATH,
				audio_workspace, sizeof(audio_workspace),
				&decode_stats);
			if (error != 0) {
				printk("Opus reply decode failed: %d\n", error);
				audio_cycle_result = error;
				flash_led(8U, 100, 100);
				continue;
			}
			pendant_cloud_reply_pcm_bytes =
				decode_stats.output_bytes;
			pendant_cloud_reply_sample_rate =
				PENDANT_OPUS_REPLY_SAMPLE_RATE;
			reply_pcm_path = PENDANT_CLOUD_REPLY_PCM_PATH;
		}
		if (error != 0) {
			printk("Agent reply download failed: %d (HTTP=%d)\n",
			       error, pendant_cloud_last_http_status);
			audio_cycle_result = error;
			flash_led(7U, 100, 100);
			continue;
		}

		/*
		 * Repeating pairs of short flashes mean the agent response is ready.
		 * A deliberate third button press starts Bluetooth playback.
		 */
		audio_cycle_phase = 5U;
		clear_button_events();
		wait_for_reply_playback_press();

		/* Playing: LED remains solid for the duration of agent speech. */
		audio_cycle_phase = 6U;
		gpio_pin_set_dt(&led, 1);
		int telemetry_error =
			pendant_cloud_report_playback_started();

		if (telemetry_error != 0) {
			printk("Playback-start telemetry failed: %d\n",
			       telemetry_error);
		}
		error = play_agent_reply(i2s, reply_pcm_path);
		telemetry_error =
			pendant_cloud_report_playback_result(error);
		if (telemetry_error != 0) {
			printk("Playback-result telemetry failed: %d\n",
			       telemetry_error);
		}
		gpio_pin_set_dt(&led, 0);
		if (error != 0) {
			printk("Agent reply I2S playback failed: %d\n", error);
			audio_cycle_result = error;
			flash_led(9U, 100, 100);
			continue;
		}

		audio_cycle_phase = 7U;
		audio_cycle_result = 0;
		for (unsigned int flash = 0U; flash < 3U; ++flash) {
			gpio_pin_set_dt(&led, 1);
			k_msleep(180);
			gpio_pin_set_dt(&led, 0);
			k_msleep(180);
		}
		k_msleep(200);
	}
}
